// ****************************************************************************************************
// ****************************************************************************************************
// РАЗДЕЛ A. Целочисленная арифметика
// ****************************************************************************************************
// ****************************************************************************************************

// РАЗДЕЛ A1. Целочисленная арифметика. Простейшие задачи

// ****************************************************************************************************
// ****************************************************************************************************

// A1.1. Дано расстояние в сантиметрах. Найти число полных метров в нем.

// Console.WriteLine("Введите расстояние в сантиметрах:");
// int distance = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Перевод сантиметров в метры. Расстояние = {distance / 100} полных метров");

// ****************************************************************************************************

// A1.2. Дана масса в килограммах. Найти число полных центнеров в ней.

// Console.WriteLine("Введите массу в килограммах:");
// int weight = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Перевод киллограммы в центнеры. Масса = {weight / 100} полных центнеров");

// ****************************************************************************************************

// A1.3. Дана масса в килограммах. Найти число полных тонн в ней.

// Console.WriteLine("Введите массу в килограммах:");
// int weight = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Перевод киллограммы в тонны. Масса = {weight / 1000} полных тонн");

// ****************************************************************************************************

// A1.4. Дано расстояние в метрах. Найти число полных километров в нем.

// Console.WriteLine("Введите расстояние в метрах:");
// int distance = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Перевод метров в километры. Расстояние = {distance / 1000} полных километров");

// ****************************************************************************************************

// A1.5. С некоторого момента прошло 234 дня. Сколько полных недель прошло за этот период?

// Console.WriteLine($"С некоторого момента прошло 234 дня. Что составило {234 / 7} полных недель и осталось ещё {234 % 7} дней");

// ****************************************************************************************************

// A1.6. С начала суток прошло n секунд. Определить:
// а) сколько полных часов прошло с начала суток;
// б) сколько полных минут прошло с начала очередного часа;
// в) сколько полных секунд прошло с начала очередной минуты.

// Console.WriteLine("Введите сколько прошло секунд с начала суток:");
// int time = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"С начала суток прошло {time / 3600} часов");
// Console.WriteLine($"С начала очередного часа прошло {time % 3600 / 60} минут");
// Console.WriteLine($"С начала очередной минуты прошло {time % 3600 % 60} секунд");

// ****************************************************************************************************

// A1.7. Дан прямоугольник с размерами 543 х 130 мм. Сколько квадратов со стороной 130 мм можно отрезать от него?

// int square = 130;
// int i = 0;

// while (square < 543)
// {
//     square = square + 130;
//     i++;
// }
// Console.WriteLine($"{i} - столько квадратов со стороной 130 мм можно отрезать от прямоугольника размером 543 х 130 мм");

// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************



// ****************************************************************************************************


